#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/poimgs/test-github-actions-and-terraform/runs/run-boyMNnMgyYrc4BZB[0m
[0m
Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
[0m[1mgoogle_compute_instance.vm_instance: Refreshing state... [id=projects/learn-terraform-337209/zones/asia-southeast1-c/instances/terraform-instance][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_compute_instance.vm_instance[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "google_compute_instance" "vm_instance" {
        [1m[0mid[0m[0m                   = "projects/learn-terraform-337209/zones/asia-southeast1-c/instances/terraform-instance"
      [32m+[0m [0m[1m[0mlabels[0m[0m               = {}
      [32m+[0m [0m[1m[0mmetadata[0m[0m             = {}
        [1m[0mname[0m[0m                 = "terraform-instance"
      [32m+[0m [0m[1m[0mresource_policies[0m[0m    = []
      [32m+[0m [0m[1m[0mtags[0m[0m                 = []
        [90m# (14 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # google_compute_instance.vm_instance[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_compute_instance" "vm_instance" {
      [33m~[0m [0m[1m[0mcpu_platform[0m[0m         = "Intel Skylake" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcurrent_status[0m[0m       = "RUNNING" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0menable_display[0m[0m       = false [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mguest_accelerator[0m[0m    = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                   = "projects/learn-terraform-337209/zones/asia-southeast1-c/instances/terraform-instance" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_id[0m[0m          = "1484734909941375079" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mlabel_fingerprint[0m[0m    = "42WmSpB8rSM=" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mlabels[0m[0m               = {} [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmetadata[0m[0m             = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mmetadata_fingerprint[0m[0m = "trRZi46LIS4=" [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m     = (known after apply)
      [33m~[0m [0m[1m[0mname[0m[0m                 = "terraform-instance" [33m->[0m [0m"updated-terraform-instance" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m              = "learn-terraform-337209" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mresource_policies[0m[0m    = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mself_link[0m[0m            = "https://www.googleapis.com/compute/v1/projects/learn-terraform-337209/zones/asia-southeast1-c/instances/terraform-instance" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                 = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_fingerprint[0m[0m     = "42WmSpB8rSM=" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mzone[0m[0m                 = "asia-southeast1-c" [33m->[0m [0m(known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m [0mboot_disk {
          [33m~[0m [0m[1m[0mdevice_name[0m[0m                = "persistent-disk-0" [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mdisk_encryption_key_sha256[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_self_link[0m[0m          = (known after apply)
          [33m~[0m [0m[1m[0msource[0m[0m                     = "https://www.googleapis.com/compute/v1/projects/learn-terraform-337209/zones/asia-southeast1-c/disks/terraform-instance" [33m->[0m [0m(known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m

          [33m~[0m [0minitialize_params {
              [33m~[0m [0m[1m[0mimage[0m[0m  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-10-buster-v20220118" [33m->[0m [0m"debian-10-buster-v20220118"
              [33m~[0m [0m[1m[0mlabels[0m[0m = {} [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0msize[0m[0m   = 10 [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mtype[0m[0m   = "pd-standard" [33m->[0m [0m(known after apply)
            }
        }

      [32m+[0m [0mconfidential_instance_config {
          [32m+[0m [0m[1m[0menable_confidential_compute[0m[0m = (known after apply)
        }

      [33m~[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mipv6_access_type[0m[0m   = (known after apply)
          [33m~[0m [0m[1m[0mname[0m[0m               = "nic0" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mnetwork[0m[0m            = "https://www.googleapis.com/compute/v1/projects/learn-terraform-337209/global/networks/default" [33m->[0m [0m"default"
          [33m~[0m [0m[1m[0mnetwork_ip[0m[0m         = "10.148.0.8" [33m->[0m [0m(known after apply)
          [31m-[0m [0m[1m[0mqueue_count[0m[0m        = 0 [90m->[0m [0m[90mnull[0m[0m
          [33m~[0m [0m[1m[0mstack_type[0m[0m         = "IPV4_ONLY" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0msubnetwork[0m[0m         = "https://www.googleapis.com/compute/v1/projects/learn-terraform-337209/regions/asia-southeast1/subnetworks/default" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0msubnetwork_project[0m[0m = "learn-terraform-337209" [33m->[0m [0m(known after apply)

          [33m~[0m [0maccess_config {
              [33m~[0m [0m[1m[0mnat_ip[0m[0m       = "34.126.82.181" [33m->[0m [0m(known after apply)
              [33m~[0m [0m[1m[0mnetwork_tier[0m[0m = "PREMIUM" [33m->[0m [0m(known after apply)
            }
        }

      [32m+[0m [0mreservation_affinity {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)

          [32m+[0m [0mspecific_reservation {
              [32m+[0m [0m[1m[0mkey[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m = (known after apply)
            }
        }

      [33m~[0m [0mscheduling {
          [33m~[0m [0m[1m[0mautomatic_restart[0m[0m   = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mmin_node_cpus[0m[0m       = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mon_host_maintenance[0m[0m = "MIGRATE" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mpreemptible[0m[0m         = false [33m->[0m [0m(known after apply)

          [32m+[0m [0mnode_affinities {
              [32m+[0m [0m[1m[0mkey[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0moperator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mvalues[0m[0m   = (known after apply)
            }
        }

      [31m-[0m [0mshielded_instance_config {
          [31m-[0m [0m[1m[0menable_integrity_monitoring[0m[0m = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_secure_boot[0m[0m          = false [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0menable_vtpm[0m[0m                 = true [90m->[0m [0m[90mnull[0m[0m
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mip[0m[0m = "34.126.82.181" [33m->[0m [0m(known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "GOOGLE_CREDENTIALS" but
[33m│[0m [0ma value was found in file "/terraform/terraform.tfvars". If you meant to
[33m│[0m [0muse this value, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

```

</details>

*Pusher: @poimgs, Action: `pull_request`*